{
  "snippets": [
    {
      "id": 1770365735958,
      "title": "Miglioramento cinematico immagini",
      "text": "Glow around the silhouette. The shadows must be\ncrushed deep black, with distinct cool teal and muted dark green undertones visible in the darker background areas. Add a heavy, authentic analog film grain texture over the entire image. Shallow depth of field, high contrast chiaroscuro lighting, atmospheric,\nemotional, dark cinematic aesthetic.",
      "tags": [
        "grafica",
        "upscale",
        "cinematico",
        "cinema",
        "milgioramento"
      ]
    },
    {
      "id": 1768994320341,
      "title": "Restauro foto vecchia",
      "text": "Pure photographic texture restoration.\nPreserve original identity, facial structure, age and expression.\nReconstruct real human skin texture with visible pores, fine wrinkles,\nuneven micro details and natural imperfections.\nNatural skin translucency, realistic subsurface scattering.\nEnhance individual hair strands with natural thickness and randomness.\nRestore fabric texture with realistic fibers, stitching and wear.\nNo beautification, no retouching, no smoothing, no stylization.\nDocumentary photography realism.\n\nNEGATIVE PROMPT: plastic skin, wax skin, beauty retouch, smooth\nface, de-aging, cinematic lighting, HDR, oversharpen, Al artifacts, fake\ntexture, illustration, hyperreal",
      "tags": [
        "grafica",
        "restauro",
        "foto",
        "ripristino"
      ]
    },
    {
      "id": 1768992556826,
      "title": "Upscale ingrandimento generativo",
      "text": "Rebuild the image in ultra high resolution, enhancing realism and micro-details while keeping the character perfectly consistent with the reference. Preserve facial identity, proportions, and overall style with absolute fidelity.\n\nUpgrade material quality: add more realistic clothing fabric texture (weave, stitching, folds) and improve the environment surfaces (materials, reflections, roughness, depth) without altering the scene.\n\nDo NOT change composition, camera angle, framing, setting, pose, or action. Everything must remain identical only refine detail quality and realism.\n\nMaintain the same realistic documentary lighting, filmed from the shadow side, with natural contrast and subtle highlights.\n\nUse a cinematic camera/lens look (shallow depth of field, natural bokeh). Keep the original environment and lighting exactly the same.",
      "tags": [
        "grafica",
        "upscale",
        "qualità",
        "miglioramento"
      ]
    },
    {
      "id": 1765290191169,
      "title": "UI Kit app",
      "text": "Prompt UI Kit & Design System Specification\n\nObiettivo: Creare un'interfaccia dashboard analitica per report social che sia pulita, corporate e altamente funzionale. Framework visivo: Stile \"Flat/Clean\" con leggera profondità (ombre) e forte gerarchia tipografica.\n1. Palette Colori & Variabili Globali\n\nUtilizzare rigorosamente i seguenti codici esadecimali per mantenere la coerenza del brand:\n\n    Primary Brand (Blu Istituzionale): #00529F (Usato per Header, Tab attive, Icone principali).\n\n    Primary Hover: #003e7e (Stato hover degli elementi interattivi primari).\n\n    Background App: #f4f6f8 (Grigio molto chiaro per lo sfondo pagina).\n\n    Surface/Card Background: #ffffff (Bianco puro).\n\n    Text Main: #2c3e50 (Grigio scuro/Blu notte per testi principali e numeri).\n\n    Text Secondary: #607d8b (Grigio bluastro per etichette, date e descrizioni).\n\n    Accent Success (Action Buttons/Toast): #27ae60 (Verde smeraldo). Hover: #219150.\n\n    Accent Warning (Export Buttons): #f1c40f (Giallo/Oro). Hover: #d4ac0d.\n\n    Borders/Dividers: #e2e8f0 (Grigio chiaro).\n\n2. Tipografia\n\n    Font Family: \"Segoe UI\", \"Helvetica Neue\", Arial, sans-serif.\n\n    Gerarchia:\n\n        H1 (Header): 1.4rem/1.5rem, Weight 600, Colore Bianco.\n\n        H2 (Card Titles): 1.2rem, Colore Primary (#00529F), con border-bottom decorativo.\n\n        H3 (Section Titles): 1.1rem, Weight 600, Colore Text Main.\n\n        Body Text: 15px/16px, Line-height 1.5/1.6.\n\n        Data/Numbers: 1.6rem o 1.8rem, Weight 700.\n\n3. Layout & Struttura\n\n    Container: Larghezza massima 1400px, centrato, padding laterale 1.5rem.\n\n    Header: Sticky (position: sticky, top: 0), background Primary, shadow leggera. Deve contenere il Titolo a sinistra e l'azione principale (es. \"Scarica JSON\") a destra.\n\n    Card Design (Generale):\n\n        Background: White.\n\n        Border-radius: 8px (o 12px per le Social Card).\n\n        Border: 1px solid #e1e4e8.\n\n        Shadow: 0 2px 8px rgba(0,0,0,0.08).\n\n        Padding interno: 1.5rem.\n\n4. Componenti UI Specifici\n\nA. Upload Area (Drag & Drop)\n\n    Stile: Box con bordo tratteggiato (3px dashed #cbd5e0).\n\n    Stato Default: Sfondo bianco. Icona grande centrale (3rem, Primary Color).\n\n    Stato Hover: Bordo Primary (#00529F), sfondo azzurro chiarissimo (#f0f7ff).\n\n    Feedback: Testo che cambia durante il caricamento (\"Elaborazione in corso...\").\n\nB. Navigazione a Tab\n\n    Contenitore: Flex row, border-bottom 2px solid #e2e8f0.\n\n    Tab Button:\n\n        Forma: Rettangolare con angoli superiori arrotondati.\n\n        Stato Inattivo: Sfondo bianco, testo #607d8b, bordo grigio chiaro.\n\n        Stato Attivo: Sfondo Primary (#00529F), testo Bianco, bordo Primary.\n\n        Animazione: Fade-in/Slide-up leggero al cambio contenuto.\n\nC. KPI Stat Cards (Grid View)\n\n    Layout: Grid responsive (minmax(220px, 1fr)).\n\n    Stile Card: Rettangolare, padding ridotto, Bordo sinistro colorato (5px solid #ddd default, diventa Primary on hover).\n\n    Effetto Hover: Traslazione Y negativa (-3px) per effetto sollevamento.\n\n    Contenuto:\n\n        Label (Uppercase, small, gray) + Icona Social.\n\n        Valore (Large, bold).\n\n        Tasto Copia: Obbligatorio accanto al valore numerico.\n\nD. Social Post Feed (Visualizzazione \"Card\")\n\n    Design: Deve ricordare un post social, non una riga di tabella.\n\n    Struttura Card:\n\n        Header: Icona canale (grande), Label autore (bold), Data (small).\n\n        Body:\n\n            Topic Pill: Badge arrotondato (border-radius: 20px), sfondo #eef2f7, testo Primary, uppercase.\n\n            Copy Text: Testo del post, leggibile, con tasto \"Copia\" posizionato in alto a destra o all'inizio del blocco.\n\n        Footer: Sfondo leggermente più scuro (#f8fafc), metriche (Eye icon/Thumbs up icon) colorate, Tasto Link esterno sulla destra.\n\n    Interazione: Hover sulla card aumenta l'ombra e solleva l'elemento.\n\nE. Tabelle Dati\n\n    Header (th): Sfondo #f8fafc, testo scuro, font-weight 700.\n\n    Righe (tr): Border-bottom sottile. Hover background #f7fafc.\n\n    Celle (td): Vertical align middle.\n\n    Funzionalità obbligatoria: Ogni cella contenente un dato utile deve avere un Copy Button invisibile che appare all'hover della riga o del dato.\n\nF. Bottoni e Controlli\n\n    Button \"Copia\":\n\n        Stile: Icona (<i class=\"far fa-copy\"></i>), background trasparente, nessun bordo.\n\n        Colore: Grigio chiaro (#cbd5e0) default, Primary (#00529F) on hover.\n\n        Feedback: Cambia in icona \"Check\" verde (#27ae60) per 1.5s dopo il click.\n\n    Button \"Export/Excel\": Background Giallo (#f1c40f), testo scuro, border-radius 4px. Icona Excel a sinistra.\n\n    Select Dropdown: Padding generoso (10px), border-radius 6px, bordo #cbd5e0.\n\n5. Feedback Utente (Toast Notifications)\n\n    Posizione: Fixed, Top-Right.\n\n    Stile: Box fluttuante, shadow marcata, icona a sinistra.\n\n    Varianti:\n\n        Success: Background Verde (#27ae60), testo bianco.\n\n        Error: Background Rosso (#e74c3c), testo bianco.\n\n    Animazione: Slide-in da destra.\n\nNote Funzionali per l'Allineamento\n\nQuando applichi questo design a nuove app, assicurati che:\n\n    Dati copiabili: Il design system prevede che ogni singolo dato atomico (date, numeri, testi) sia affiancato dal componente copy-btn. Non rimuoverlo per estetica; è una feature core.\n\n    Responsività: Le griglie (Stats e Post Cards) devono usare auto-fill con minmax per adattarsi a schermi grandi (fino a 1400px) e piccoli.\n\n    Iconografia: Usa le icone del brand del canale social nel colore Primary blue (#00529F) per uniformità, salvo dove indicato diversamente (es. metriche specifiche).",
      "tags": [
        "UI",
        "UI Kit",
        "minimalista",
        "grafica"
      ]
    },
    {
      "id": 1764932511335,
      "title": "Semplificazione numeri K ed M",
      "text": "I numeri superiori a 999 devono essere semplificati in K per le migliaia e M per i milioni. Inserisci due cifre decimali, ma elimina le cifre decimali che finiscono con 0.\nAd esempio 15.232 diventa 15,23K mentre 15.802 diventa 15,8K e 15.000 diventa 15K.\nI numeri decimali devono sempre essere separati attraverso una virgola dai numeri interi.",
      "tags": [
        "numeri",
        "K",
        "M",
        "decimali",
        "semplificazione"
      ]
    },
    {
      "id": 1763736229516,
      "title": "Infografica Gemini",
      "text": "Titolo principale: \"IA Generativa: numeri chiave\".\n\nStruttura a 5 sezioni principali con grafici,\nicone e dati evidenziati. Contenuto da visualizzare:\n\n600 milioni di pErsone usano ChatGPT ogni settimana (+100% YoY)\n\n$244 miliardi: valore previsto del mercato dell'Al generativa entro 2025\n\n65% delle aziende Fortune 500 sta integrando soluzioni di GenAl\n\n52% dei marketer dichiara un aumento di produttività",
      "tags": [
        "grafica",
        "infografica"
      ]
    },
    {
      "id": 1763734423433,
      "title": "Ritratto in primissimo piano iper realistico di una ragazza",
      "text": "Ritratto in primissimo piano di una giovane donna, luce naturale, texture della pelle distinta con pori e lievi imperfezioni, sfondo leggermente sfocato, scattato su\npellicola 35mm, obiettivo 85mm, f/1.8, iperrealistico, occhi a fuoco.",
      "tags": [
        "grafica",
        "ritratto",
        "iper realistico",
        "foto"
      ]
    },
    {
      "id": 1763390074172,
      "title": "Da PDF Siglari a csv",
      "text": "Sei un assistente per l'elaborazione dati. Ho una serie di file PDF che contengono siglari aziendali. Devo estrarre il testo da tutti questi PDF e formattarlo in un unico file .txt.\n\nOgni PDF contiene una tabella a due colonne, 'DESCRIZIONE FRAZIONARIO' e 'SIGLA'. Il testo grezzo estratto dai PDF è formattato in questo modo:\n\"DESCRIZIONE...\n\",\"SIGLA...\n\"\n\nIl tuo compito è processare questo testo ed generare un file .txt dove ogni riga contiene ESATTAMENTE i due campi, separati da una virgola, e racchiusi tra virgolette.\n\nFormato di output desiderato per OGNI riga:\n\"<DESCRIZIONE>\",\"<SIGLA>\"\n\nRegole importanti:\n1.  Ignora le intestazioni della tabella (come \"DESCRIZIONE FRAZIONARIO\", \"SIGLA\") e qualsiasi altra riga che non segua questo schema.\n2.  Non includere nuove righe (\n) all'interno delle virgolette.\n3.  L'output finale deve essere un unico blocco di testo pronto per essere salvato in un file .txt.\n\nChiedimi di caricare i PDF, elaborali e forniscimi il contenuto del file .txt da scaricare.",
      "tags": [
        "siglario",
        "csv",
        "gerarchia"
      ]
    },
    {
      "id": 1763116099967,
      "title": "Immagine 3d impacchettata in una busta trasparente",
      "text": "Create a high-resolution, hyperrealistic image of a [attached object] sealed inside a vacuum-packed, crinkled metallic or transparent plastic pouch. The packaging should tightly conform to the shape of the object, exaggerating its curves, edges, and texture as if suctioned in place.\nInclude condensation or small creases around pressure points for added realism. The object inside should retain a bold, clean look - graphic or iconic in shape (eg. smiley face, toy, tool, accessory).The background should be white/soft gray and minimal to let the reflections and surface tension of the vacuum packaging stand out dramatically.\nOptionally, include barcode labels, printed product codes, or branded text for a dystopian, collectible or archival look.Visual Details: Crushed, transparent or metallic vacuum plastic Object's silhouette visible in extreme detail Harsh lighting to emphasize texture and form Typographic overlays, SKU codes or branding Moody, product display-style background Mood: Experimental, edgy, collectible, post-consumer Bright natural lighting enhances the vivid colors and gives a clean, cinematic realistic look.",
      "tags": [
        "grafica",
        "3d",
        "pacchetto",
        "trasparente",
        "ai"
      ]
    },
    {
      "id": 1763022219947,
      "title": "Restauro e colori vecchia foto ritratto",
      "text": "Ultra-realistic recreation of an old vintage photo,\nkeeping the same original face (99% likeness, no\nalteration). Transform into a modern high-quality\ndigital portrait with vibrant updated colors,\nsmooth realistic skin textures, and natural light-\ning. The outfit and background should be up-\ngraded into a clean, modern aesthetic while pre-\nserving the authenticity of the original pose and\nexpression.",
      "tags": [
        "restauro",
        "foto",
        "vecchia",
        "colori",
        "foto",
        "grafica"
      ]
    },
    {
      "id": 1762854069715,
      "title": "PATCH APPORTARE MODIFICHE AL CODICE",
      "text": "Sto sviluppando una web app e avrò bisogno del tuo aiuto per effettuare modifiche al codice (HTML, CSS, JS, ecc.). \n\n***MODIFICA RICHIESTA***\n\n\n\n***MODALITA' MODIFICA***\nPer applicare queste modifiche, utilizzo un tool software che funziona esclusivamente tramite \"Cerca e Sostituisci\" per interi blocchi di codice.\n\nQuesto significa che non posso usare istruzioni come \"aggiungi questo attributo\" o \"modifica la riga 5\". Ho bisogno che tu mi fornisca esattamente il blocco di codice sorgente da eliminare e esattamente il blocco di codice nuovo che lo rimpiazzerà.\n\nIstruzioni Vincolanti per la Risposta: Ogni volta che ti chiederò una modifica al codice, la tua risposta deve seguire scrupolosamente uno dei due formati seguenti, a seconda della portata della modifica.\n\nCASO 1: Modifiche Piccole, Singole o Mirate\n\nQuesto è il metodo preferito per modifiche di piccola entità (es. cambiare il testo di un <p>, modificare uno stile inline, aggiungere un <div> attorno a un elemento esistente, correggere un singolo attributo).\n\nLa tua risposta deve essere strutturata esclusivamente in questo modo:\n\nUn blocco di codice formattato contenente il codice vecchio, preceduto dalla dicitura ### ✂️ BLOCCO DA RIMUOVERE:.\n\nUn blocco di codice formattato contenente il codice nuovo, preceduto dalla dicitura ### ✨ BLOCCO SOSTITUTIVO:.\n\nVincoli Assoluti per il CASO 1:\n\nEsattezza: Il BLOCCO DA RIMUOVERE deve essere una copia letterale, carattere per carattere (inclusi spazi, tabulazioni e interruzioni di riga) del codice originale che devo sostituire.\n\nCompletezza: Il BLOCCO SOSTITUTIVO deve essere il blocco di codice completo e aggiornato che rimpiazza quello vecchio.\n\nNiente Spiegazioni Intermedie: Non inserire nessun testo, commento o spiegazione tra i due blocchi di codice. Qualsiasi nota esplicativa deve essere aggiunta solo dopo aver fornito entrambi i blocchi.\n\n\nCASO 2: Modifiche Ampie, Multiple o Complesse\n\nQuesto metodo va usato se le modifiche richieste sono numerose (es. 3-4 modifiche separate in punti diversi del file) o strutturalmente ampie (es. rifattorizzare un'intera sezione, cambiare l'ordine di molti elementi).\n\nIn questo caso, non usare il metodo \"Rimuovi/Sostituisci\".\n\nLa tua risposta deve invece fornire:\n\nL'intero contenuto del file aggiornato, completo di tutte le modifiche, preceduto dalla dicitura ### 📄 CODICE COMPLETO AGGIORNATO:.",
      "tags": [
        "modifica",
        "html",
        "blocchi",
        "pezzi",
        "editing",
        "patch"
      ]
    },
    {
      "id": 1762851207642,
      "title": "Ritratto professionale",
      "text": "A professional, high-resolution studio headshot of the same person, maintaining exact facial structure and realistic skin texture.\nFramed from the chest up, looking directly at the camera with a confident and approachable expression.\nWearing [descrivi l'abbigliamento].\nLighting is soft but directional, coming from the side and slightly above, sculpting the face and adding a subtle catchlight in the eyes.\nThe background is a clean neutral gradient (gray, blue, or graphite) with smooth falloff and no distractions.\nCaptured on an 85mm f/1.8 lens with shallow depth of field, cinematic color grading, and fine detail in the eyes and hair.\nThe image conveys [le caratteristiche che vuoi trasmettere: trust, closeness, approachability,leadership, creativity, professionalism]\n- perfect for a Linkedin profile photo.",
      "tags": [
        "foto",
        "linkedin",
        "ritratto",
        "ritratto professionale",
        "grafica"
      ]
    },
    {
      "id": 1761294837917,
      "title": "App db influencer",
      "text": "***INTRO WEB APP JS PER GITHUB***\n\nMi occorre il codice html per una web app che utilizzi codice JS e contenga all'interno del codice html sia il codice JS che il codice CSS. L'app deve funzionare bene in locale e su un repository statico di Githb o simili.\n\nSpiego nel carattaeristiche e le funzionalità della web app nelle sezioni seguenti del prompt.\n\n\n***FUNZIONALITA'***\n\nL'app serve a creare un db di profili social.\n\nDovrà permettere di aggiungere nuovi record con le seguenti voci:\n\n1) Nome\n\n2) Descrizione\n\n3) Selettore Categoria tra \"Politico\", \"Giornalista\", \"Ente/istituzione\", \"Altro\"\n\n4) Profilo X -> Campo nome e campo indirizzo (il campo indirizzo si compilerà automaticamente con l'inserimento del nome in base a questa logica: se il nome inserito è TheEconomist oppure @TheEconomist l'indirizzo sarà https://x.com/TheEconomist)\n\n5) Facebook -> Campo nome e campo indirizzo\n\n6) Instagram -> Campo nome e campo indirizzo\n\n7) Youtube -> Campo nome e campo indirizzo\n\n8) TikTok -> Campo nome e campo indirizzo (il campo indirizzo si compilerà\n\nautomaticamente con l'inserimento del nome in base a questa logica: se\n\nil nome inserito è skysport oppure @skysport l'indirizzo sarà\n\nhttps://www.tiktok.com/@skysport)\n\n\nQuando si crea un nuovo record, il record vuoto apparirà in alto per primo.\n\nI record dovranno essere riordinabili in base alla data di inserimento che apparirà in piccolo in ciascua scheda del db.\n\nUn toogle permetterà di selezionare la vista compatta in cui si vede solo il nome, la descrizione e la categoria selezionata oppure la vista completa.\n\n\n--CONTROLLO DUPLICATI--\n\nSe il nome inserito è già presente l'app deve avvisare e chiedere se creare una nuova scheda o modificare la scheda esistente. Quindi in primis andrà inserito il nome e solo dopo la verifica duplicati sarà possibile procedere con l'inserimento degi altri dati.\n\n\n--SEZIONE RICERCHE--\n\nInserisci una sezione per le ricerche che permetta di impostare filtri di ricerca in base ai dati testuali inseriti, anche gestendo gli operatori booleani, alle categorie, alle date di inserimento del record, al canale (i canali devono poter essere selezionati singolarmente o anche liberamente).\n\n\n--- SEZIONE ESPORTAZIONE---\n\nL'intero db dovrà poter essere esportato in locale in formato json. Il nome del file dovrà avere la data dell'esportazione. Dovrà essere possibile importare da file json esportato.\n\nInoltre dovrà essere possibile effettuare esportazioni nei seguenti formati, esportando solo i risultati applicati attraverso i filtri:\n\n1) Excel (tutti i campi)\n\n2) Filtro Talkwalker -> File in formato testo formattato in questo modo (author:\"giornaledibrescia\" OR author:\"codacons\" OR author:\"Mr LUL lepaghediale\"); il testo tra virgolette riprodurrà il campo nome dei record.\n\n\n\n***INSERIMENTO FAVICON***\n\nNel codice inserisci dove opportuno \n\n<link rel=\"icon\" href=\"favicon.ico\">\n\n\n---\n\n\n***INFORMAZIONI USER INTERFACE POSTE STYLE***\n\nRealizza la grafica ispirandoti al sito ufficiale di Poste Italiane (www.poste.it) e al suo branding visivo, con uso predominante dei colori giallo (#eddc01) e blu (#0146bc) istituzionali.\n\nLa UI deve essere:\n\n* Chiara, elegante e moderna, adatta a un’utenza professionale.\n\n* Caratterizzata da linee, riquadri e sezioni ben delimitate per una fruizione ordinata e intuitiva.\n\n* Strutturata con titoli e sottotitoli esplicativi che guidino l’utente nelle varie sezioni dell’interfaccia.\n\n* Con tasti in flat design (senza ombre o effetti tridimensionali) dallo stile semplice ma riconoscibile.\n\n* Ogni tasto deve includere un messaggio contestuale incorporato nel bottone stesso quando viene cliccato (es. \"Caricamento in corso...\", \"Fatto!\", ecc.).\n\nUlteriori elementi desiderati:\n\n* Utilizzo equilibrato di spazi bianchi, icone minimaliste monocromatiche, tipografia leggibile (preferibilmente sans-serif).\n\n* Layout responsivo adatto a desktop e mobile.\n\n* Possibilità di animazioni leggere o microinterazioni (es. hover sugli elementi attivi, feedback visivo al click).\n\nObiettivo: creare un’interfaccia piacevole da guardare e semplice da usare, coerente con l’identità visiva di Poste Italiane. Mantieni comunque un certo minimalismo e non inserire una molteplicità di colori\n\n\nNon nominare mai Poste Italiane né nell’html né nel frontend dell’app",
      "tags": [
        "db",
        "social",
        "influencer",
        "talkwalker"
      ]
    },
    {
      "id": 1760624481199,
      "title": "Illustrazione in bianco e nero e grgio",
      "text": "Crea un'illustrazione stilizzata abbastanza dettagliata, ma senza eccedere, pensata per un pubblico di adolescenti (13-18 anni). Il disegno deve essere lineare e chiaro, con contorni puliti e decisi, evitando sia uno stile infantile che grottesco o satirico. ***ASPECT RATIO*** L'immagine deve avere tassativamente formato landscape orizzontale 8:3. ***COLORI*** Non usare colori. La palette cromatica è limitata a bianco, nero e un'unica tonalità di grigio, utilizzata con moderazione e sapientemente per creare ombreggiature, dare profondità e texture agli elementi. \n\n***DETTAGLI DELL'IMMAGINE*** L'immagine deve presentare una buona quantità di dettagli, che aggiungano interesse visivo senza appesantire la composizione. L'atmosfera è equilibrata con attenzione alla composizione e all'espressività dei personaggi o degli elementi. \n\n***COSA DEVE RAPPRESENTARE***",
      "tags": [
        "illustrazione",
        "scuola",
        "libri",
        "bianco e nero",
        "nero",
        "bianco",
        "disegno",
        "china",
        "grafica"
      ]
    },
    {
      "id": 1760621497237,
      "title": "Aspect Ratio 8:3 Landscape",
      "text": "L’immagine generata deve avere tassativamente un aspect ratio 8:3 landscape e non deve avere spazi completamente vuoti nelle parti esterne dell'immagine.",
      "tags": [
        "landscape",
        "grafica",
        "immagine",
        "immagini",
        "risoluzione",
        "8:3",
        "grafica"
      ]
    },
    {
      "id": 1760541388337,
      "title": "INTRO WEB APP JS PER GITHUB",
      "text": "Mi occorre il codice html per una web app che utilizzi codice JS e contenga all'interno del codice html sia il codice JS che il codice CSS. L'app deve funzionare bene in locale e su un repository statico di Githb o simili.\nSpiego nel carattaeristiche e le funzionalità della web app nelle sezioni seguenti del prompt.",
      "tags": [
        "intro",
        "app",
        "js",
        "html",
        "javascript",
        "github",
        "nuova app"
      ]
    },
    {
      "id": 1760540898273,
      "title": "INFORMAZIONI USER INTERFACE POSTE STYLE",
      "text": "Realizza la grafica ispirandoti al sito ufficiale di Poste Italiane (www.poste.it) e al suo branding visivo, con uso predominante dei colori giallo (#eddc01) e blu (#0146bc) istituzionali.\nLa UI deve essere:\n* Chiara, elegante e moderna, adatta a un’utenza professionale.\n* Caratterizzata da linee, riquadri e sezioni ben delimitate per una fruizione ordinata e intuitiva.\n* Strutturata con titoli e sottotitoli esplicativi che guidino l’utente nelle varie sezioni dell’interfaccia.\n* Con tasti in flat design (senza ombre o effetti tridimensionali) dallo stile semplice ma riconoscibile.\n* Ogni tasto deve includere un messaggio contestuale incorporato nel bottone stesso quando viene cliccato (es. \"Caricamento in corso...\", \"Fatto!\", ecc.).\nUlteriori elementi desiderati:\n* Utilizzo equilibrato di spazi bianchi, icone minimaliste monocromatiche, tipografia leggibile (preferibilmente sans-serif).\n* Layout responsivo adatto a desktop e mobile.\n* Possibilità di animazioni leggere o microinterazioni (es. hover sugli elementi attivi, feedback visivo al click).\nObiettivo: creare un’interfaccia piacevole da guardare e semplice da usare, coerente con l’identità visiva di Poste Italiane. Mantieni comunque un certo minimalismo e non inserire una molteplicità di colori\n\nNon nominare mai Poste Italiane né nell’html né nel frontend dell’app",
      "tags": [
        "ui",
        "poste",
        "poste italiane",
        "posteitaliane",
        "grafica",
        "stile",
        "interfaccia",
        "grafica",
        "interfccia grafica",
        "nuova app"
      ]
    },
    {
      "id": 1760540770439,
      "title": "INSERIMENTO FAVICON",
      "text": "Nel codice inserisci dove opportuno \n<link rel=\"icon\" href=\"favicon.ico\">",
      "tags": [
        "favicon",
        "nuova app"
      ]
    },
    {
      "id": 1760540727616,
      "title": "ESTRAZIONE CALENDARIO FILATELICO DA PDF",
      "text": "In questo PDF, a partire dalla pagina 3 c’è una tabella che contiene il calendario delle emissioni filateliche, Mi occorre che lo analizzi e riporti i contenuti in una tabella composta da due colonne \"Argomento\" e \"Data”.\n\nNella colonna Argomento inserisci il testo riportato accanto al numero 1,, 2, ecc e nella colonna data. Inserisci la data corrispondente.\nPer tutti gli argomenti che non hanno data inerisci come data 31/12/2025.\n\nRimuovi eventuali caratteri che non riesci a decodificare.\n\nIl risultato finale dovrà essere una stringa di testo csv esportabile e incollabole in altre applicazioni",
      "tags": [
        "calendario",
        "filatelico",
        "emissioni",
        "filatelia",
        "poste",
        "poste italiane",
        "posteitaliane"
      ]
    }
  ],
  "selectedIds": [
    1760541388337
  ]
}
